pivoine31/esp32-weather-epd-pvmod/platformio/src/display_utils.cpp
/* Display helper utilities for esp32-weather-epd.
 * Copyright (C) 2022-2026  Luke Marzen
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <https://www.gnu.org/licenses/>.
 */

#include <cmath>
#include <vector>
#include <Arduino.h>

#include <esp_idf_version.h>

#if ESP_IDF_VERSION_MAJOR < 5
#include <driver/adc.h>
#include <esp_adc_cal.h>
#else
#include <driver/gpio.h>
#include <esp_adc/adc_oneshot.h>
#include <esp_adc/adc_cali.h>
#include <esp_adc/adc_cali_scheme.h>
#endif

#include <aqi.h>

#include "_locale.h"
#include "_strftime.h"
#include "api_response.h"
#include "config.h"
#include "display_utils.h"

// icon header files
#include "icons/icons.h"

/* Returns battery voltage in millivolts (mv).
 */
uint32_t readBatteryVoltage()
{
#if ESP_IDF_VERSION_MAJOR < 5
  /*********************************
   * Code for ESP32 framework 2.x.x
   *********************************/
  esp_adc_cal_characteristics_t adc_chars;
  // __attribute__((unused)) disables compiler warnings about this variable
  // being unused (Clang, GCC) which is the case when DEBUG_LEVEL == 0.
  esp_adc_cal_value_t val_type __attribute__((unused));
  adc_power_acquire();
  uint16_t adc_val = analogRead(PIN_BAT_ADC);
  adc_power_release();

  // We will use the eFuse ADC calibration bits, to get accurate voltage
  // readings. The DFRobot FireBeetle Esp32-E V1.0's ADC is 12 bit, and uses
  // 11db attenuation, which gives it a measurable input voltage range of 150mV
  // to 2450mV.
  val_type = esp_adc_cal_characterize(ADC_UNIT_1, ADC_ATTEN_11db,
                                      ADC_WIDTH_BIT_12, 1100, &adc_chars);

#if DEBUG_LEVEL >= 1
  if (val_type == ESP_ADC_CAL_VAL_EFUSE_VREF)
  {
    Serial.println("[debug] ADC Cal eFuse Vref");
  }
  else if (val_type == ESP_ADC_CAL_VAL_EFUSE_TP)
  {
    Serial.println("[debug] ADC Cal Two Point");
  }
  else
  {
    Serial.println("[debug] ADC Cal Default");
  }
#endif

  uint32_t batteryVoltage = esp_adc_cal_raw_to_voltage(adc_val, &adc_chars);
  // [Asdf1qaz contribution]
  // Take into account DFRobot FireBeetle Esp32-E V1.0 voltage divider
  // Divider may be adjusted slighly (in config.h) to take into account 
  // some correction after checking the battery voltage using a multimeter
  batteryVoltage *= VOLT_MULT;

#else

  /*********************************
   * Code for ESP32 framework 3.x.x
   *********************************/
#define BAT_ADC_CHAN  ADC_CHANNEL_6
  
  // From :
  // https://docs.espressif.com/projects/esp-idf/en/stable/esp32/api-reference/peripherals/adc_oneshot.html
  // https://docs.espressif.com/projects/esp-idf/en/stable/esp32/api-reference/peripherals/adc_calibration.html
  int adc_raw[2][10];
  int voltage[2][10];

  // ESP_ERROR_CHECK_WITHOUT_ABORT is an alternative
 
  //-------------ADC1 Init---------------//
  adc_oneshot_unit_handle_t   adc1_handle;
  adc_oneshot_unit_init_cfg_t init_config1 = { .unit_id = ADC_UNIT_1 };

  ESP_ERROR_CHECK(adc_oneshot_new_unit(&init_config1, &adc1_handle));

  //-------------ADC1 Config---------------//
  adc_oneshot_chan_cfg_t config = {
      .atten    = ADC_ATTEN_DB_12,
      .bitwidth = ADC_BITWIDTH_12, // ADC_BITWIDTH_DEFAULT 
  };
  ESP_ERROR_CHECK(adc_oneshot_config_channel(adc1_handle, BAT_ADC_CHAN, &config));

  //-------------ADC1 Calibration Init---------------//
  adc_cali_handle_t adc1_cali_chan0_handle = NULL;
  adc_cali_line_fitting_config_t cali_config = {
      .unit_id  = init_config1.unit_id,
      .atten    = config.atten,
      .bitwidth = config.bitwidth,
      .default_vref = 1100,
  };

#if DEBUG_LEVEL >= 1
  adc_cali_line_fitting_efuse_val_t val_type;
  
  ESP_ERROR_CHECK(adc_cali_scheme_line_fitting_check_efuse(&val_type));

  if (val_type == ADC_CALI_LINE_FITTING_EFUSE_VAL_EFUSE_VREF)
  {
    Serial.println("[debug] ADC Cal eFuse Vref");
  }
  else if (val_type == ADC_CALI_LINE_FITTING_EFUSE_VAL_EFUSE_TP )
  {
    Serial.println("[debug] ADC Cal Two Point");
  }
  else
  {
    Serial.println("[debug] ADC Cal Default");
  }
#endif

  ESP_ERROR_CHECK(adc_cali_create_scheme_line_fitting(&cali_config, &adc1_cali_chan0_handle));

  //-------------ADC1 Read ---------------//
  ESP_ERROR_CHECK(adc_oneshot_read(adc1_handle, BAT_ADC_CHAN, &adc_raw[0][0]));
  //Serial.printf("ADC%d Channel[%d] Raw Data: %d\n", init_config1.unit_id + 1, BAT_ADC_CHAN, adc_raw[0][0]);

  ESP_ERROR_CHECK(adc_cali_raw_to_voltage(adc1_cali_chan0_handle, adc_raw[0][0], &voltage[0][0]));
  //Serial.printf("ADC%d Channel[%d] Cali Voltage: %d mV\n", init_config1.unit_id + 1, BAT_ADC_CHAN, voltage[0][0]);

  //Tear Down
  ESP_ERROR_CHECK(adc_oneshot_del_unit(adc1_handle));
  ESP_ERROR_CHECK(adc_cali_delete_scheme_line_fitting(adc1_cali_chan0_handle));

  // [Asdf1qaz contribution]
  // Take into account DFRobot FireBeetle Esp32-E V1.0 voltage divider
  // Divider may be adjusted slighly (in config.h) to take into account 
  // some correction after checking the battery voltage using a multimeter
  uint32_t batteryVoltage = (uint32_t)(voltage[0][0] * VOLT_MULT);

  //Serial.printf("BTY = %ld (%d-%d)\n", batteryVoltage, adc_raw[0][0], voltage[0][0]);

#endif

  return batteryVoltage;
} // end readBatteryVoltage

/* Returns battery percentage, rounded to the nearest integer.
 * Takes a voltage in millivolts and uses a sigmoidal approximation to find an
 * approximation of the battery life percentage remaining.
 *
 * This function contains LGPLv3 code from
 * <https://github.com/rlogiacco/BatterySense>.
 *
 * Symmetric sigmoidal approximation
 * <https://www.desmos.com/calculator/7m9lu26vpy>
 *
 * c - c / (1 + k*x/v)^3
 */
uint32_t calcBatPercent(uint32_t v, uint32_t minv, uint32_t maxv)
{
  // slow
  //uint32_t p = 110 - (110 / (1 + pow(1.468 * (v - minv)/(maxv - minv), 6)));

  // steep
  //uint32_t p = 102 - (102 / (1 + pow(1.621 * (v - minv)/(maxv - minv), 8.1)));

  // normal
  uint32_t p = 105 - (105 / (1 + pow(1.724 * (v - minv)/(maxv - minv), 5.5)));
  return p >= 100 ? 100 : p;
} // end calcBatPercent

/* Returns 24x24 bitmap incidcating battery status.
 */
const uint8_t *getBatBitmap24(uint32_t batPercent)
{
  if (batPercent >= 93)
  {
    return battery_full_90deg_24x24;
  }
  else if (batPercent >= 79)
  {
    return battery_6_bar_90deg_24x24;
  }
  else if (batPercent >= 65)
  {
    return battery_5_bar_90deg_24x24;
  }
  else if (batPercent >= 50)
  {
    return battery_4_bar_90deg_24x24;
  }
  else if (batPercent >= 36)
  {
    return battery_3_bar_90deg_24x24;
  }
  else if (batPercent >= 22)
  {
    return battery_2_bar_90deg_24x24;
  }
  else if (batPercent >= 8)
  {
    return battery_1_bar_90deg_24x24;
  }
  else
  {  // batPercent < 8
    return battery_0_bar_90deg_24x24;
  }
} // end getBatBitmap24

/* Gets string with the current date.
 */
void getDateStr(String &s, tm *timeInfo)
{
  char buf[48] = {};
  _strftime(buf, sizeof(buf), DATE_FORMAT, timeInfo);
  s = buf;

  // remove double spaces. %e will add an extra space, ie. " 1" instead of "1"
  s.replace("  ", " ");
  return;
} // end getDateStr

/* Gets string with the current date and time of the current refresh attempt.
 */
void getRefreshTimeStr(String &s, bool timeSuccess, tm *timeInfo)
{
  if (timeSuccess == false)
  {
    s = TXT_UNKNOWN;
    return;
  }

  char buf[48] = {};
  _strftime(buf, sizeof(buf), REFRESH_TIME_FORMAT, timeInfo);
  s = buf;

