pivoine31/esp32-weather-epd-pvmod/platformio/src/display_utils.cpp
/* Takes the daily weather forecast (from OpenWeatherMap API response) and
 * returns a pointer to the icon's 32x32 bitmap.
 *
 * The daily weather forcast of today is needed for moonrise and moonset times.
 */
const uint8_t *getHourlyForecastBitmap32(const owm_hourly_t &hourly,
                                         const owm_daily_t  &today)
{
  const int id = hourly.weather.id;
  const bool day = isDay(hourly.weather.icon);
  const bool moon = isMoonInSky(hourly.dt, today.moonrise, today.moonset,
                                today.moon_phase);
  const bool cloudy = isCloudy(hourly.clouds);
  const bool windy = isWindy(hourly.wind_speed, hourly.wind_gust);
  return getConditionsBitmap<32>(id, day, moon, cloudy, windy);
}

/* Takes the daily weather forecast (from OpenWeatherMap API response) and
 * returns a pointer to the icon's 64x64 bitmap.
 */
const uint8_t *getDailyForecastBitmap64(const owm_daily_t &daily)
{
  const int id = daily.weather.id;
  // always show daytime icon for daily forecast
  const bool day = true;
  const bool moon = false;
  const bool cloudy = isCloudy(daily.clouds);
  const bool windy = isWindy(daily.wind_speed, daily.wind_gust);
  return getConditionsBitmap<64>(id, day, moon, cloudy, windy);
} // end getForecastBitmap64

/* Takes the current weather and today's daily weather forcast (from
 * OpenWeatherMap API response) and returns a pointer to the icon's 196x196
 * bitmap.
 *
 * The daily weather forcast of today is needed for moonrise and moonset times.
 */
const uint8_t *getCurrentConditionsBitmap196(const owm_current_t &current,
                                             const owm_daily_t   &today)
{
  const int id = current.weather.id;
  const bool day = isDay(current.weather.icon);
  const bool moon = isMoonInSky(current.dt, today.moonrise, today.moonset,
                                today.moon_phase);
  const bool cloudy = isCloudy(current.clouds);
  const bool windy = isWindy(current.wind_speed, current.wind_gust);
  return getConditionsBitmap<196>(id, day, moon, cloudy, windy);
} // end getCurrentConditionsBitmap196

/* Returns a 32x32 bitmap for a given alert.
 *
 * The purpose of this function is to return a relevant bitmap for an alert.
 * This is done by searching the event text for key terminology defined in the
 * included locale header.
 * If a relevant category can not be determined, the default alert bitmap will
 * be returned. (warning triangle icon)
 */
const uint8_t *getAlertBitmap32(const owm_alerts_t &alert)
{
  enum alert_category c = getAlertCategory(alert);
  switch (c)
  {
  // this is the default if an alert wasn't associated with a catagory
  case NOT_FOUND:            return warning_icon_32x32;

  case SMOG:                 return wi_smog_32x32;
  case SMOKE:                return wi_smoke_32x32;
  case FOG:                  return wi_fog_32x32;
  case METEOR:               return wi_meteor_32x32;
  case NUCLEAR:              return ionizing_radiation_symbol_32x32;
  case BIOHAZARD:            return biological_hazard_symbol_32x32;
  case EARTHQUAKE:           return wi_earthquake_32x32;
  case TSUNAMI:              return wi_tsunami_32x32;
  case FIRE:                 return wi_fire_32x32;
  case HEAT:                 return wi_thermometer_32x32;
  case WINTER:               return wi_snowflake_cold_32x32;
  case LIGHTNING:            return wi_lightning_32x32;
  case SANDSTORM:            return wi_sandstorm_32x32;
  case FLOOD:                return wi_flood_32x32;
  case VOLCANO:              return wi_volcano_32x32;
  case AIR_QUALITY:          return wi_dust_32x32;
  case TORNADO:              return wi_tornado_32x32;
  case SMALL_CRAFT_ADVISORY: return wi_small_craft_advisory_32x32;
  case GALE_WARNING:         return wi_gale_warning_32x32;
  case STORM_WARNING:        return wi_storm_warning_32x32;
  case HURRICANE_WARNING:    return wi_hurricane_warning_32x32;
  case HURRICANE:            return wi_hurricane_32x32;
  case DUST:                 return wi_dust_32x32;
  case STRONG_WIND:          return wi_strong_wind_32x32;

  // this code will never be reached
  default:                   return wi_na_48x48;
  }
} // end getAlertBitmap32

/* Returns a 48x48 bitmap for a given alert.
 *
 * The purpose of this function is to return a relevant bitmap for an alert.
 * This is done by searching the event text for key terminology defined in the
 * included locale header.
 * If a relevant category can not be determined, the default alert bitmap will
 * be returned. (warning triangle icon)
 */
const uint8_t *getAlertBitmap48(const owm_alerts_t &alert)
{
  enum alert_category c = getAlertCategory(alert);
  switch (c)
  {
  // this is the default if an alert wasn't associated with a catagory
  case NOT_FOUND:            return warning_icon_48x48;

  case SMOG:                 return wi_smog_48x48;
  case SMOKE:                return wi_smoke_48x48;
  case FOG:                  return wi_fog_48x48;
  case METEOR:               return wi_meteor_48x48;
  case NUCLEAR:              return ionizing_radiation_symbol_48x48;
  case BIOHAZARD:            return biological_hazard_symbol_48x48;
  case EARTHQUAKE:           return wi_earthquake_48x48;
  case TSUNAMI:              return wi_tsunami_48x48;
  case FIRE:                 return wi_fire_48x48;
  case HEAT:                 return wi_thermometer_48x48;
  case WINTER:               return wi_snowflake_cold_48x48;
  case LIGHTNING:            return wi_lightning_48x48;
  case SANDSTORM:            return wi_sandstorm_48x48;
  case FLOOD:                return wi_flood_48x48;
  case VOLCANO:              return wi_volcano_48x48;
  case AIR_QUALITY:          return wi_dust_48x48;
  case TORNADO:              return wi_tornado_48x48;
  case SMALL_CRAFT_ADVISORY: return wi_small_craft_advisory_48x48;
  case GALE_WARNING:         return wi_gale_warning_48x48;
  case STORM_WARNING:        return wi_storm_warning_48x48;
  case HURRICANE_WARNING:    return wi_hurricane_warning_48x48;
  case HURRICANE:            return wi_hurricane_48x48;
  case DUST:                 return wi_dust_48x48;
  case STRONG_WIND:          return wi_strong_wind_48x48;

  // this code will never be reached
  default:                   return wi_na_48x48;
  }
} // end getAlertBitmap48

/* Returns true of a String, s, contains any of the strings in the terminology
 * vector.
 *
 * Note: This function is case sensitive.
 */
bool containsTerminology(const String s, const std::vector<String> &terminology)
{
  for (const String &term : terminology)
  {
    if (s.indexOf(term) >= 0)
    {
      return true;
    }
  }
  return false;
} // end containsTerminology

/* Returns the category of an alert based on the terminology found in the event
 * name.
 *
 * Weather alert terminology is defined in the included locale header.
 */
enum alert_category getAlertCategory(const owm_alerts_t &alert)
{
  if (containsTerminology(alert.event, TERM_SMOG))
  {
    return alert_category::SMOG;
  }
  if (containsTerminology(alert.event, TERM_SMOKE))
  {
    return alert_category::SMOKE;
  }
  if (containsTerminology(alert.event, TERM_FOG))
  {
    return alert_category::FOG;
  }
  if (containsTerminology(alert.event, TERM_METEOR))
  {
    return alert_category::METEOR;
  }
  if (containsTerminology(alert.event, TERM_NUCLEAR))
  {
    return alert_category::NUCLEAR;
  }
  if (containsTerminology(alert.event, TERM_BIOHAZARD))
  {
    return alert_category::BIOHAZARD;
  }
  if (containsTerminology(alert.event, TERM_EARTHQUAKE))
  {
    return alert_category::EARTHQUAKE;
  }
  if (containsTerminology(alert.event, TERM_FIRE))
  {
    return alert_category::FIRE;
  }
  if (containsTerminology(alert.event, TERM_HEAT))
  {
    return alert_category::HEAT;
  }
  if (containsTerminology(alert.event, TERM_WINTER))
  {
    return alert_category::WINTER;
  }
  if (containsTerminology(alert.event, TERM_TSUNAMI))
  {
    return alert_category::TSUNAMI;
  }
  if (containsTerminology(alert.event, TERM_LIGHTNING))
  {
    return alert_category::LIGHTNING;
  }
  if (containsTerminology(alert.event, TERM_SANDSTORM))
  {
    return alert_category::SANDSTORM;
  }
  if (containsTerminology(alert.event, TERM_FLOOD))
  {
    return alert_category::FLOOD;
  }
  if (containsTerminology(alert.event, TERM_VOLCANO))
  {
    return alert_category::VOLCANO;
  }
  if (containsTerminology(alert.event, TERM_AIR_QUALITY))
  {
    return alert_category::AIR_QUALITY;
  }
  if (containsTerminology(alert.event, TERM_TORNADO))
  {
    return alert_category::TORNADO;
  }
  if (containsTerminology(alert.event, TERM_SMALL_CRAFT_ADVISORY))
  {
    return alert_category::SMALL_CRAFT_ADVISORY;
  }
  if (containsTerminology(alert.event, TERM_GALE_WARNING))
  {
    return alert_category::GALE_WARNING;
  }
  if (containsTerminology(alert.event, TERM_STORM_WARNING))
  {
    return alert_category::STORM_WARNING;
  }
  if (containsTerminology(alert.event, TERM_HURRICANE_WARNING))
  {
    return alert_category::HURRICANE_WARNING;
  }
  if (containsTerminology(alert.event, TERM_HURRICANE))
  {
    return alert_category::HURRICANE;
  }
  if (containsTerminology(alert.event, TERM_DUST))
  {
    return alert_category::DUST;
  }
  if (containsTerminology(alert.event, TERM_STRONG_WIND))
  {
    return alert_category::STRONG_WIND;
  }
  return alert_category::NOT_FOUND;
} // end getAlertCategory

