pivoine31/esp32-weather-epd-pvmod/platformio/src/display_utils.cpp
#ifdef WIND_ICONS_CARDINAL
static const unsigned char *wind_direction_icon_arr[] = {
  wind_direction_meteorological_0deg_24x24,    // N
  wind_direction_meteorological_90deg_24x24,   // E
  wind_direction_meteorological_180deg_24x24,  // S
  wind_direction_meteorological_270deg_24x24}; // W
#endif // end WIND_ICONS_CARDINAL
#ifdef WIND_ICONS_INTERCARDINAL
static const unsigned char *wind_direction_icon_arr[] = {
  wind_direction_meteorological_0deg_24x24,    // N
  wind_direction_meteorological_45deg_24x24,   // NE
  wind_direction_meteorological_90deg_24x24,   // E
  wind_direction_meteorological_135deg_24x24,  // SE
  wind_direction_meteorological_180deg_24x24,  // S
  wind_direction_meteorological_225deg_24x24,  // SW
  wind_direction_meteorological_270deg_24x24,  // W
  wind_direction_meteorological_315deg_24x24}; // NW
#endif // end WIND_ICONS_INTERCARDINAL
#ifdef WIND_ICONS_SECONDARY_INTERCARDINAL
static const unsigned char *wind_direction_icon_arr[] = {
  wind_direction_meteorological_0deg_24x24,      // N
  wind_direction_meteorological_22_5deg_24x24,   // NNE
  wind_direction_meteorological_45deg_24x24,     // NE
  wind_direction_meteorological_67_5deg_24x24,   // ENE
  wind_direction_meteorological_90deg_24x24,     // E
  wind_direction_meteorological_112_5deg_24x24,  // ESE
  wind_direction_meteorological_135deg_24x24,    // SE
  wind_direction_meteorological_157_5deg_24x24,  // SSE
  wind_direction_meteorological_180deg_24x24,    // S
  wind_direction_meteorological_202_5deg_24x24,  // SSW
  wind_direction_meteorological_225deg_24x24,    // SW
  wind_direction_meteorological_247_5deg_24x24,  // WSW
  wind_direction_meteorological_270deg_24x24,    // W
  wind_direction_meteorological_292_5deg_24x24,  // WNW
  wind_direction_meteorological_315deg_24x24,    // NW
  wind_direction_meteorological_337_5deg_24x24}; // NNW
#endif // end WIND_ICONS_SECONDARY_INTERCARDINAL
#ifdef WIND_ICONS_TERTIARY_INTERCARDINAL
static const unsigned char *wind_direction_icon_arr[] = {
  wind_direction_meteorological_0deg_24x24,       // N
  wind_direction_meteorological_11_25deg_24x24,   // NbE
  wind_direction_meteorological_22_5deg_24x24,    // NNE
  wind_direction_meteorological_33_75deg_24x24,   // NEbN
  wind_direction_meteorological_45deg_24x24,      // NE
  wind_direction_meteorological_56_25deg_24x24,   // NEbE
  wind_direction_meteorological_67_5deg_24x24,    // ENE
  wind_direction_meteorological_78_75deg_24x24,   // EbN
  wind_direction_meteorological_90deg_24x24,      // E
  wind_direction_meteorological_101_25deg_24x24,  // EbS
  wind_direction_meteorological_112_5deg_24x24,   // ESE
  wind_direction_meteorological_123_75deg_24x24,  // SEbE
  wind_direction_meteorological_135deg_24x24,     // SE
  wind_direction_meteorological_146_25deg_24x24,  // SEbS
  wind_direction_meteorological_157_5deg_24x24,   // SSE
  wind_direction_meteorological_168_75deg_24x24,  // SbE
  wind_direction_meteorological_180deg_24x24,     // S
  wind_direction_meteorological_191_25deg_24x24,  // SbW
  wind_direction_meteorological_202_5deg_24x24,   // SSW
  wind_direction_meteorological_213_75deg_24x24,  // SWbS
  wind_direction_meteorological_225deg_24x24,     // SW
  wind_direction_meteorological_236_25deg_24x24,  // SWbW
  wind_direction_meteorological_247_5deg_24x24,   // WSW
  wind_direction_meteorological_258_75deg_24x24,  // WbS
  wind_direction_meteorological_270deg_24x24,     // W
  wind_direction_meteorological_281_25deg_24x24,  // WbN
  wind_direction_meteorological_292_5deg_24x24,   // WNW
  wind_direction_meteorological_303_75deg_24x24,  // NWbW
  wind_direction_meteorological_315deg_24x24,     // NW
  wind_direction_meteorological_326_25deg_24x24,  // NWbN
  wind_direction_meteorological_337_5deg_24x24,   // NNW
  wind_direction_meteorological_348_75deg_24x24}; // NbW
#endif // end WIND_ICONS_TERTIARY_INTERCARDINAL
#ifdef WIND_ICONS_360
static const unsigned char *wind_direction_icon_arr[] = {
  wind_direction_meteorological_0deg_24x24,
  wind_direction_meteorological_1deg_24x24,
  wind_direction_meteorological_2deg_24x24,
  wind_direction_meteorological_3deg_24x24,
  wind_direction_meteorological_4deg_24x24,
  wind_direction_meteorological_5deg_24x24,
  wind_direction_meteorological_6deg_24x24,
  wind_direction_meteorological_7deg_24x24,
  wind_direction_meteorological_8deg_24x24,
  wind_direction_meteorological_9deg_24x24,
  wind_direction_meteorological_10deg_24x24,
  wind_direction_meteorological_11deg_24x24,
  wind_direction_meteorological_12deg_24x24,
  wind_direction_meteorological_13deg_24x24,
  wind_direction_meteorological_14deg_24x24,
  wind_direction_meteorological_15deg_24x24,
  wind_direction_meteorological_16deg_24x24,
  wind_direction_meteorological_17deg_24x24,
  wind_direction_meteorological_18deg_24x24,
  wind_direction_meteorological_19deg_24x24,
  wind_direction_meteorological_20deg_24x24,
  wind_direction_meteorological_21deg_24x24,
  wind_direction_meteorological_22deg_24x24,
  wind_direction_meteorological_23deg_24x24,
  wind_direction_meteorological_24deg_24x24,
  wind_direction_meteorological_25deg_24x24,
  wind_direction_meteorological_26deg_24x24,
  wind_direction_meteorological_27deg_24x24,
  wind_direction_meteorological_28deg_24x24,
  wind_direction_meteorological_29deg_24x24,
  wind_direction_meteorological_30deg_24x24,
  wind_direction_meteorological_31deg_24x24,
  wind_direction_meteorological_32deg_24x24,
  wind_direction_meteorological_33deg_24x24,
  wind_direction_meteorological_34deg_24x24,
  wind_direction_meteorological_35deg_24x24,
  wind_direction_meteorological_36deg_24x24,
  wind_direction_meteorological_37deg_24x24,
  wind_direction_meteorological_38deg_24x24,
  wind_direction_meteorological_39deg_24x24,
  wind_direction_meteorological_40deg_24x24,
  wind_direction_meteorological_41deg_24x24,
  wind_direction_meteorological_42deg_24x24,
  wind_direction_meteorological_43deg_24x24,
  wind_direction_meteorological_44deg_24x24,
  wind_direction_meteorological_45deg_24x24,
  wind_direction_meteorological_46deg_24x24,
  wind_direction_meteorological_47deg_24x24,
  wind_direction_meteorological_48deg_24x24,
  wind_direction_meteorological_49deg_24x24,
  wind_direction_meteorological_50deg_24x24,
  wind_direction_meteorological_51deg_24x24,
  wind_direction_meteorological_52deg_24x24,
  wind_direction_meteorological_53deg_24x24,
  wind_direction_meteorological_54deg_24x24,
  wind_direction_meteorological_55deg_24x24,
  wind_direction_meteorological_56deg_24x24,
  wind_direction_meteorological_57deg_24x24,
  wind_direction_meteorological_58deg_24x24,
  wind_direction_meteorological_59deg_24x24,
  wind_direction_meteorological_60deg_24x24,
  wind_direction_meteorological_61deg_24x24,
  wind_direction_meteorological_62deg_24x24,
  wind_direction_meteorological_63deg_24x24,
  wind_direction_meteorological_64deg_24x24,
  wind_direction_meteorological_65deg_24x24,
  wind_direction_meteorological_66deg_24x24,
  wind_direction_meteorological_67deg_24x24,
  wind_direction_meteorological_68deg_24x24,
  wind_direction_meteorological_69deg_24x24,
  wind_direction_meteorological_70deg_24x24,
  wind_direction_meteorological_71deg_24x24,
  wind_direction_meteorological_72deg_24x24,
  wind_direction_meteorological_73deg_24x24,
  wind_direction_meteorological_74deg_24x24,
  wind_direction_meteorological_75deg_24x24,
  wind_direction_meteorological_76deg_24x24,
  wind_direction_meteorological_77deg_24x24,
  wind_direction_meteorological_78deg_24x24,
  wind_direction_meteorological_79deg_24x24,
  wind_direction_meteorological_80deg_24x24,
  wind_direction_meteorological_81deg_24x24,
  wind_direction_meteorological_82deg_24x24,
  wind_direction_meteorological_83deg_24x24,
  wind_direction_meteorological_84deg_24x24,
  wind_direction_meteorological_85deg_24x24,
  wind_direction_meteorological_86deg_24x24,
  wind_direction_meteorological_87deg_24x24,
  wind_direction_meteorological_88deg_24x24,
  wind_direction_meteorological_89deg_24x24,
  wind_direction_meteorological_90deg_24x24,
  wind_direction_meteorological_91deg_24x24,
  wind_direction_meteorological_92deg_24x24,
  wind_direction_meteorological_93deg_24x24,
  wind_direction_meteorological_94deg_24x24,
  wind_direction_meteorological_95deg_24x24,
  wind_direction_meteorological_96deg_24x24,
  wind_direction_meteorological_97deg_24x24,
  wind_direction_meteorological_98deg_24x24,
  wind_direction_meteorological_99deg_24x24,
  wind_direction_meteorological_100deg_24x24,
  wind_direction_meteorological_101deg_24x24,
  wind_direction_meteorological_102deg_24x24,
  wind_direction_meteorological_103deg_24x24,
  wind_direction_meteorological_104deg_24x24,
  wind_direction_meteorological_105deg_24x24,
  wind_direction_meteorological_106deg_24x24,
  wind_direction_meteorological_107deg_24x24,
  wind_direction_meteorological_108deg_24x24,
  wind_direction_meteorological_109deg_24x24,
  wind_direction_meteorological_110deg_24x24,
  wind_direction_meteorological_111deg_24x24,
  wind_direction_meteorological_112deg_24x24,
  wind_direction_meteorological_113deg_24x24,
  wind_direction_meteorological_114deg_24x24,
  wind_direction_meteorological_115deg_24x24,
  wind_direction_meteorological_116deg_24x24,
  wind_direction_meteorological_117deg_24x24,
  wind_direction_meteorological_118deg_24x24,
  wind_direction_meteorological_119deg_24x24,
  wind_direction_meteorological_120deg_24x24,
  wind_direction_meteorological_121deg_24x24,
  wind_direction_meteorological_122deg_24x24,
  wind_direction_meteorological_123deg_24x24,
  wind_direction_meteorological_124deg_24x24,
  wind_direction_meteorological_125deg_24x24,
  wind_direction_meteorological_126deg_24x24,
  wind_direction_meteorological_127deg_24x24,
  wind_direction_meteorological_128deg_24x24,
  wind_direction_meteorological_129deg_24x24,
  wind_direction_meteorological_130deg_24x24,
  wind_direction_meteorological_131deg_24x24,
  wind_direction_meteorological_132deg_24x24,
  wind_direction_meteorological_133deg_24x24,
  wind_direction_meteorological_134deg_24x24,
  wind_direction_meteorological_135deg_24x24,
  wind_direction_meteorological_136deg_24x24,
  wind_direction_meteorological_137deg_24x24,
  wind_direction_meteorological_138deg_24x24,
  wind_direction_meteorological_139deg_24x24,
  wind_direction_meteorological_140deg_24x24,
  wind_direction_meteorological_141deg_24x24,
  wind_direction_meteorological_142deg_24x24,
  wind_direction_meteorological_143deg_24x24,
  wind_direction_meteorological_144deg_24x24,
  wind_direction_meteorological_145deg_24x24,
  wind_direction_meteorological_146deg_24x24,
  wind_direction_meteorological_147deg_24x24,
  wind_direction_meteorological_148deg_24x24,
  wind_direction_meteorological_149deg_24x24,
  wind_direction_meteorological_150deg_24x24,
  wind_direction_meteorological_151deg_24x24,
  wind_direction_meteorological_152deg_24x24,
  wind_direction_meteorological_153deg_24x24,
  wind_direction_meteorological_154deg_24x24,
  wind_direction_meteorological_155deg_24x24,
  wind_direction_meteorological_156deg_24x24,
  wind_direction_meteorological_157deg_24x24,
  wind_direction_meteorological_158deg_24x24,
  wind_direction_meteorological_159deg_24x24,
  wind_direction_meteorological_160deg_24x24,
  wind_direction_meteorological_161deg_24x24,
  wind_direction_meteorological_162deg_24x24,
  wind_direction_meteorological_163deg_24x24,
  wind_direction_meteorological_164deg_24x24,
  wind_direction_meteorological_165deg_24x24,
  wind_direction_meteorological_166deg_24x24,
  wind_direction_meteorological_167deg_24x24,
  wind_direction_meteorological_168deg_24x24,
  wind_direction_meteorological_169deg_24x24,
  wind_direction_meteorological_170deg_24x24,
  wind_direction_meteorological_171deg_24x24,
  wind_direction_meteorological_172deg_24x24,
  wind_direction_meteorological_173deg_24x24,
  wind_direction_meteorological_174deg_24x24,
  wind_direction_meteorological_175deg_24x24,
  wind_direction_meteorological_176deg_24x24,
  wind_direction_meteorological_177deg_24x24,
  wind_direction_meteorological_178deg_24x24,
  wind_direction_meteorological_179deg_24x24,
  wind_direction_meteorological_180deg_24x24,
  wind_direction_meteorological_181deg_24x24,
  wind_direction_meteorological_182deg_24x24,
  wind_direction_meteorological_183deg_24x24,
  wind_direction_meteorological_184deg_24x24,
  wind_direction_meteorological_185deg_24x24,
  wind_direction_meteorological_186deg_24x24,
  wind_direction_meteorological_187deg_24x24,
  wind_direction_meteorological_188deg_24x24,
  wind_direction_meteorological_189deg_24x24,
  wind_direction_meteorological_190deg_24x24,
  wind_direction_meteorological_191deg_24x24,
  wind_direction_meteorological_192deg_24x24,
  wind_direction_meteorological_193deg_24x24,
  wind_direction_meteorological_194deg_24x24,
  wind_direction_meteorological_195deg_24x24,
  wind_direction_meteorological_196deg_24x24,
  wind_direction_meteorological_197deg_24x24,
  wind_direction_meteorological_198deg_24x24,
  wind_direction_meteorological_199deg_24x24,
  wind_direction_meteorological_200deg_24x24,
  wind_direction_meteorological_201deg_24x24,
  wind_direction_meteorological_202deg_24x24,
  wind_direction_meteorological_203deg_24x24,
  wind_direction_meteorological_204deg_24x24,
  wind_direction_meteorological_205deg_24x24,
  wind_direction_meteorological_206deg_24x24,
  wind_direction_meteorological_207deg_24x24,
  wind_direction_meteorological_208deg_24x24,
  wind_direction_meteorological_209deg_24x24,
  wind_direction_meteorological_210deg_24x24,
  wind_direction_meteorological_211deg_24x24,
  wind_direction_meteorological_212deg_24x24,
  wind_direction_meteorological_213deg_24x24,
  wind_direction_meteorological_214deg_24x24,
  wind_direction_meteorological_215deg_24x24,
  wind_direction_meteorological_216deg_24x24,
  wind_direction_meteorological_217deg_24x24,
  wind_direction_meteorological_218deg_24x24,
  wind_direction_meteorological_219deg_24x24,
  wind_direction_meteorological_220deg_24x24,
  wind_direction_meteorological_221deg_24x24,
  wind_direction_meteorological_222deg_24x24,
  wind_direction_meteorological_223deg_24x24,
  wind_direction_meteorological_224deg_24x24,
  wind_direction_meteorological_225deg_24x24,
  wind_direction_meteorological_226deg_24x24,
  wind_direction_meteorological_227deg_24x24,
  wind_direction_meteorological_228deg_24x24,
  wind_direction_meteorological_229deg_24x24,
  wind_direction_meteorological_230deg_24x24,
  wind_direction_meteorological_231deg_24x24,
  wind_direction_meteorological_232deg_24x24,
  wind_direction_meteorological_233deg_24x24,
  wind_direction_meteorological_234deg_24x24,
  wind_direction_meteorological_235deg_24x24,
  wind_direction_meteorological_236deg_24x24,
  wind_direction_meteorological_237deg_24x24,
  wind_direction_meteorological_238deg_24x24,
  wind_direction_meteorological_239deg_24x24,
  wind_direction_meteorological_240deg_24x24,
  wind_direction_meteorological_241deg_24x24,
  wind_direction_meteorological_242deg_24x24,
  wind_direction_meteorological_243deg_24x24,
  wind_direction_meteorological_244deg_24x24,
  wind_direction_meteorological_245deg_24x24,
  wind_direction_meteorological_246deg_24x24,
  wind_direction_meteorological_247deg_24x24,
  wind_direction_meteorological_248deg_24x24,
  wind_direction_meteorological_249deg_24x24,
  wind_direction_meteorological_250deg_24x24,
  wind_direction_meteorological_251deg_24x24,
  wind_direction_meteorological_252deg_24x24,
  wind_direction_meteorological_253deg_24x24,
  wind_direction_meteorological_254deg_24x24,
  wind_direction_meteorological_255deg_24x24,
  wind_direction_meteorological_256deg_24x24,
  wind_direction_meteorological_257deg_24x24,
  wind_direction_meteorological_258deg_24x24,
  wind_direction_meteorological_259deg_24x24,
  wind_direction_meteorological_260deg_24x24,
  wind_direction_meteorological_261deg_24x24,
  wind_direction_meteorological_262deg_24x24,
  wind_direction_meteorological_263deg_24x24,
  wind_direction_meteorological_264deg_24x24,
  wind_direction_meteorological_265deg_24x24,
  wind_direction_meteorological_266deg_24x24,
  wind_direction_meteorological_267deg_24x24,
  wind_direction_meteorological_268deg_24x24,
  wind_direction_meteorological_269deg_24x24,
  wind_direction_meteorological_270deg_24x24,
  wind_direction_meteorological_271deg_24x24,
  wind_direction_meteorological_272deg_24x24,
  wind_direction_meteorological_273deg_24x24,
  wind_direction_meteorological_274deg_24x24,
  wind_direction_meteorological_275deg_24x24,
  wind_direction_meteorological_276deg_24x24,
  wind_direction_meteorological_277deg_24x24,
  wind_direction_meteorological_278deg_24x24,
  wind_direction_meteorological_279deg_24x24,
  wind_direction_meteorological_280deg_24x24,
  wind_direction_meteorological_281deg_24x24,
  wind_direction_meteorological_282deg_24x24,
  wind_direction_meteorological_283deg_24x24,
  wind_direction_meteorological_284deg_24x24,
  wind_direction_meteorological_285deg_24x24,
  wind_direction_meteorological_286deg_24x24,
  wind_direction_meteorological_287deg_24x24,
  wind_direction_meteorological_288deg_24x24,
  wind_direction_meteorological_289deg_24x24,
  wind_direction_meteorological_290deg_24x24,
  wind_direction_meteorological_291deg_24x24,
  wind_direction_meteorological_292deg_24x24,
  wind_direction_meteorological_293deg_24x24,
  wind_direction_meteorological_294deg_24x24,
  wind_direction_meteorological_295deg_24x24,
  wind_direction_meteorological_296deg_24x24,
  wind_direction_meteorological_297deg_24x24,
  wind_direction_meteorological_298deg_24x24,
  wind_direction_meteorological_299deg_24x24,
  wind_direction_meteorological_300deg_24x24,
  wind_direction_meteorological_301deg_24x24,
  wind_direction_meteorological_302deg_24x24,
  wind_direction_meteorological_303deg_24x24,
  wind_direction_meteorological_304deg_24x24,
  wind_direction_meteorological_305deg_24x24,
  wind_direction_meteorological_306deg_24x24,
  wind_direction_meteorological_307deg_24x24,
  wind_direction_meteorological_308deg_24x24,
  wind_direction_meteorological_309deg_24x24,
  wind_direction_meteorological_310deg_24x24,
  wind_direction_meteorological_311deg_24x24,
  wind_direction_meteorological_312deg_24x24,
  wind_direction_meteorological_313deg_24x24,
  wind_direction_meteorological_314deg_24x24,
  wind_direction_meteorological_315deg_24x24,
  wind_direction_meteorological_316deg_24x24,
  wind_direction_meteorological_317deg_24x24,
  wind_direction_meteorological_318deg_24x24,
  wind_direction_meteorological_319deg_24x24,
  wind_direction_meteorological_320deg_24x24,
  wind_direction_meteorological_321deg_24x24,
  wind_direction_meteorological_322deg_24x24,
  wind_direction_meteorological_323deg_24x24,
  wind_direction_meteorological_324deg_24x24,
  wind_direction_meteorological_325deg_24x24,
  wind_direction_meteorological_326deg_24x24,
  wind_direction_meteorological_327deg_24x24,
  wind_direction_meteorological_328deg_24x24,
  wind_direction_meteorological_329deg_24x24,
  wind_direction_meteorological_330deg_24x24,
  wind_direction_meteorological_331deg_24x24,
  wind_direction_meteorological_332deg_24x24,
  wind_direction_meteorological_333deg_24x24,
  wind_direction_meteorological_334deg_24x24,
  wind_direction_meteorological_335deg_24x24,
  wind_direction_meteorological_336deg_24x24,
  wind_direction_meteorological_337deg_24x24,
  wind_direction_meteorological_338deg_24x24,
  wind_direction_meteorological_339deg_24x24,
  wind_direction_meteorological_340deg_24x24,
  wind_direction_meteorological_341deg_24x24,
  wind_direction_meteorological_342deg_24x24,
  wind_direction_meteorological_343deg_24x24,
  wind_direction_meteorological_344deg_24x24,
  wind_direction_meteorological_345deg_24x24,
  wind_direction_meteorological_346deg_24x24,
  wind_direction_meteorological_347deg_24x24,
  wind_direction_meteorological_348deg_24x24,
  wind_direction_meteorological_349deg_24x24,
  wind_direction_meteorological_350deg_24x24,
  wind_direction_meteorological_351deg_24x24,
  wind_direction_meteorological_352deg_24x24,
  wind_direction_meteorological_353deg_24x24,
  wind_direction_meteorological_354deg_24x24,
  wind_direction_meteorological_355deg_24x24,
  wind_direction_meteorological_356deg_24x24,
  wind_direction_meteorological_357deg_24x24,
  wind_direction_meteorological_358deg_24x24,
  wind_direction_meteorological_359deg_24x24};
#endif // end WIND_ICONS_360

/* Returns a 24x24 wind direction icon bitmap for angles 0 to 359 degrees
 * Parameter is meteorological wind direction, arrow points in the direction the
 * wind is going.
 */
const uint8_t *getWindBitmap24(int windDeg)
{
  windDeg %= 360; // enforce domain
  // number of directions
  int n = sizeof(wind_direction_icon_arr)
          / sizeof(wind_direction_icon_arr[0]);
  int arr_offset = (int) ( (windDeg + (360 / n / 2)) % 360 )
                         / ( 360 / (float) n );

  return wind_direction_icon_arr[arr_offset];
} // end getWindBitmap24

/* Returns a pointer to a string that expresses the Compass Point Notation (CPN)
 * of the given windDeg.
 *
 *   PRECISION                  #     ERROR   EXAMPLE
 *   Cardinal                   4  ±45.000°   E
 *   Intercardinal (Ordinal)    8  ±22.500°   NE
 *   Secondary Intercardinal   16  ±11.250°   NNE
 *   Tertiary Intercardinal    32   ±5.625°   NbE
 */
const char *getCompassPointNotation(int windDeg)
{
#if defined(WIND_INDICATOR_CPN_CARDINAL)
  const int precision = 4;
#elif defined(WIND_INDICATOR_CPN_INTERCARDINAL)
  const int precision = 8;
#elif defined(WIND_INDICATOR_CPN_SECONDARY_INTERCARDINAL)
  const int precision = 16;
#elif defined(WIND_INDICATOR_CPN_TERTIARY_INTERCARDINAL)
  const int precision = 32;
#else
  const int precision = 4;
#endif

  windDeg %= 360; // enforce domain
  int arr_offset = (int) (windDeg / ( 360 / (float) precision ))
                         * ( 32 / precision) ;

  return COMPASS_POINT_NOTATION[arr_offset];
} // end getCompassPointNotation

/* This function returns a pointer to a string representing the meaning for a
 * HTTP response status code or an arduino client error code.
 * ArduinoJson DeserializationError codes are also included here and are given a
 * negative 100 offset to distinguish them from other client error codes.
 *
 * HTTP response status codes [100, 599]
 * https://developer.mozilla.org/en-US/docs/Web/HTTP/Status
 *
 * HTTP client errors [0, -255]
 * https://github.com/espressif/arduino-esp32/blob/master/libraries/HTTPClient/src/HTTPClient.h
 *
 * ArduinoJson DeserializationError codes [-256, -511]
 * https://arduinojson.org/v6/api/misc/deserializationerror/
 *
 * WiFi Status codes [-512, -767]
 * https://github.com/espressif/arduino-esp32/blob/master/libraries/WiFi/src/WiFiType.h
 */
const char *getHttpResponsePhrase(int code)
{
  switch (code)
  {
  // 1xx - Informational Responses
  case 100: return TXT_HTTP_RESPONSE_100;
  case 101: return TXT_HTTP_RESPONSE_101;
  case 102: return TXT_HTTP_RESPONSE_102;
  case 103: return TXT_HTTP_RESPONSE_103;

