pivoine31/esp32-weather-epd-pvmod/platformio/src/display_utils.cpp
  // 2xx - Successful Responses
  case 200: return TXT_HTTP_RESPONSE_200;
  case 201: return TXT_HTTP_RESPONSE_201;
  case 202: return TXT_HTTP_RESPONSE_202;
  case 203: return TXT_HTTP_RESPONSE_203;
  case 204: return TXT_HTTP_RESPONSE_204;
  case 205: return TXT_HTTP_RESPONSE_205;
  case 206: return TXT_HTTP_RESPONSE_206;
  case 207: return TXT_HTTP_RESPONSE_207;
  case 208: return TXT_HTTP_RESPONSE_208;
  case 226: return TXT_HTTP_RESPONSE_226;

  // 3xx - Redirection Responses
  case 300: return TXT_HTTP_RESPONSE_300;
  case 301: return TXT_HTTP_RESPONSE_301;
  case 302: return TXT_HTTP_RESPONSE_302;
  case 303: return TXT_HTTP_RESPONSE_303;
  case 304: return TXT_HTTP_RESPONSE_304;
  case 305: return TXT_HTTP_RESPONSE_305;
  case 307: return TXT_HTTP_RESPONSE_307;
  case 308: return TXT_HTTP_RESPONSE_308;

  // 4xx - Client Error Responses
  case 400: return TXT_HTTP_RESPONSE_400;
  case 401: return TXT_HTTP_RESPONSE_401;
  case 402: return TXT_HTTP_RESPONSE_402;
  case 403: return TXT_HTTP_RESPONSE_403;
  case 404: return TXT_HTTP_RESPONSE_404;
  case 405: return TXT_HTTP_RESPONSE_405;
  case 406: return TXT_HTTP_RESPONSE_406;
  case 407: return TXT_HTTP_RESPONSE_407;
  case 408: return TXT_HTTP_RESPONSE_408;
  case 409: return TXT_HTTP_RESPONSE_409;
  case 410: return TXT_HTTP_RESPONSE_410;
  case 411: return TXT_HTTP_RESPONSE_411;
  case 412: return TXT_HTTP_RESPONSE_412;
  case 413: return TXT_HTTP_RESPONSE_413;
  case 414: return TXT_HTTP_RESPONSE_414;
  case 415: return TXT_HTTP_RESPONSE_415;
  case 416: return TXT_HTTP_RESPONSE_416;
  case 417: return TXT_HTTP_RESPONSE_417;
  case 418: return TXT_HTTP_RESPONSE_418;
  case 421: return TXT_HTTP_RESPONSE_421;
  case 422: return TXT_HTTP_RESPONSE_422;
  case 423: return TXT_HTTP_RESPONSE_423;
  case 424: return TXT_HTTP_RESPONSE_424;
  case 425: return TXT_HTTP_RESPONSE_425;
  case 426: return TXT_HTTP_RESPONSE_426;
  case 428: return TXT_HTTP_RESPONSE_428;
  case 429: return TXT_HTTP_RESPONSE_429;
  case 431: return TXT_HTTP_RESPONSE_431;
  case 451: return TXT_HTTP_RESPONSE_451;

  // 5xx - Server Error Responses
  case 500: return TXT_HTTP_RESPONSE_500;
  case 501: return TXT_HTTP_RESPONSE_501;
  case 502: return TXT_HTTP_RESPONSE_502;
  case 503: return TXT_HTTP_RESPONSE_503;
  case 504: return TXT_HTTP_RESPONSE_504;
  case 505: return TXT_HTTP_RESPONSE_505;
  case 506: return TXT_HTTP_RESPONSE_506;
  case 507: return TXT_HTTP_RESPONSE_507;
  case 508: return TXT_HTTP_RESPONSE_508;
  case 510: return TXT_HTTP_RESPONSE_510;
  case 511: return TXT_HTTP_RESPONSE_511;

  // HTTP client errors [0, -255]
  case HTTPC_ERROR_CONNECTION_REFUSED:  return TXT_HTTPC_ERROR_CONNECTION_REFUSED;
  case HTTPC_ERROR_SEND_HEADER_FAILED:  return TXT_HTTPC_ERROR_SEND_HEADER_FAILED;
  case HTTPC_ERROR_SEND_PAYLOAD_FAILED: return TXT_HTTPC_ERROR_SEND_PAYLOAD_FAILED;
  case HTTPC_ERROR_NOT_CONNECTED:       return TXT_HTTPC_ERROR_NOT_CONNECTED;
  case HTTPC_ERROR_CONNECTION_LOST:     return TXT_HTTPC_ERROR_CONNECTION_LOST;
  case HTTPC_ERROR_NO_STREAM:           return TXT_HTTPC_ERROR_NO_STREAM;
  case HTTPC_ERROR_NO_HTTP_SERVER:      return TXT_HTTPC_ERROR_NO_HTTP_SERVER;
  case HTTPC_ERROR_TOO_LESS_RAM:        return TXT_HTTPC_ERROR_TOO_LESS_RAM;
  case HTTPC_ERROR_ENCODING:            return TXT_HTTPC_ERROR_ENCODING;
  case HTTPC_ERROR_STREAM_WRITE:        return TXT_HTTPC_ERROR_STREAM_WRITE;
  case HTTPC_ERROR_READ_TIMEOUT:        return TXT_HTTPC_ERROR_READ_TIMEOUT;

  // ArduinoJson DeserializationError codes  [-256, -511]
  case -256 - (DeserializationError::Code::Ok):              return TXT_DESERIALIZATION_ERROR_OK;
  case -256 - (DeserializationError::Code::EmptyInput):      return TXT_DESERIALIZATION_ERROR_EMPTY_INPUT;
  case -256 - (DeserializationError::Code::IncompleteInput): return TXT_DESERIALIZATION_ERROR_INCOMPLETE_INPUT;
  case -256 - (DeserializationError::Code::InvalidInput):    return TXT_DESERIALIZATION_ERROR_INVALID_INPUT;
  case -256 - (DeserializationError::Code::NoMemory):        return TXT_DESERIALIZATION_ERROR_NO_MEMORY;
  case -256 - (DeserializationError::Code::TooDeep):         return TXT_DESERIALIZATION_ERROR_TOO_DEEP;

  // WiFi Status codes [-512, -767]
  case -512 - WL_NO_SHIELD:       return TXT_WL_NO_SHIELD;
  // case -512 - WL_STOPPED:       return TXT_WL_STOPPED; // future
  case -512 - WL_IDLE_STATUS:     return TXT_WL_IDLE_STATUS;
  case -512 - WL_NO_SSID_AVAIL:   return TXT_WL_NO_SSID_AVAIL;
  case -512 - WL_SCAN_COMPLETED:  return TXT_WL_SCAN_COMPLETED;
  case -512 - WL_CONNECTED:       return TXT_WL_CONNECTED;
  case -512 - WL_CONNECT_FAILED:  return TXT_WL_CONNECT_FAILED;
  case -512 - WL_CONNECTION_LOST: return TXT_WL_CONNECTION_LOST;
  case -512 - WL_DISCONNECTED:    return TXT_WL_DISCONNECTED;

  default:  return "";
  }
} // end getHttpResponsePhrase


/* This function returns a pointer to a string representing the meaning for a
 * WiFi status (wl_status_t).
 *
 * wl_status_t type definition
 * https://github.com/espressif/arduino-esp32/blob/master/libraries/WiFi/src/WiFiType.h
 */
const char *getWifiStatusPhrase(wl_status_t status)
{
  switch (status)
  {
  case WL_NO_SHIELD:       return TXT_WL_NO_SHIELD;
  // case WL_STOPPED:       return TXT_WL_STOPPED; // future
  case WL_IDLE_STATUS:     return TXT_WL_IDLE_STATUS;
  case WL_NO_SSID_AVAIL:   return TXT_WL_NO_SSID_AVAIL;
  case WL_SCAN_COMPLETED:  return TXT_WL_SCAN_COMPLETED;
  case WL_CONNECTED:       return TXT_WL_CONNECTED;
  case WL_CONNECT_FAILED:  return TXT_WL_CONNECT_FAILED;
  case WL_CONNECTION_LOST: return TXT_WL_CONNECTION_LOST;
  case WL_DISCONNECTED:    return TXT_WL_DISCONNECTED;

  default:  return "";
  }
} // end getWifiStatusPhrase

/* This function sets the builtin LED to LOW and disables it even during deep
 * sleep.
 */
void disableBuiltinLED()
{
  pinMode(LED_BUILTIN, OUTPUT);
  digitalWrite(LED_BUILTIN, LOW);
  gpio_hold_en(static_cast<gpio_num_t>(LED_BUILTIN));
  gpio_deep_sleep_hold_en();
  return;
} // end disableBuiltinLED

// Define the set of moon phase icon base on the chosen moon phase style
#ifdef MOONPHASE_PRIMARY
static const unsigned char *moon_phase_icon_arr[] = {
  wi_moon_new_48x48,
  wi_moon_waxing_crescent_1_48x48,
  wi_moon_waxing_crescent_2_48x48,
  wi_moon_waxing_crescent_3_48x48,
  wi_moon_waxing_crescent_4_48x48,
  wi_moon_waxing_crescent_5_48x48,
  wi_moon_waxing_6_48x48,
  wi_moon_first_quarter_48x48,
  wi_moon_waxing_gibbous_1_48x48,
  wi_moon_waxing_gibbous_2_48x48,
  wi_moon_waxing_gibbous_3_48x48,
  wi_moon_waxing_gibbous_4_48x48,
  wi_moon_waxing_gibbous_5_48x48,
  wi_moon_waxing_gibbous_6_48x48,
  wi_moon_full_48x48,
  wi_moon_waning_gibbous_1_48x48,
  wi_moon_waning_gibbous_2_48x48,
  wi_moon_waning_gibbous_3_48x48,
  wi_moon_waning_gibbous_4_48x48,
  wi_moon_waning_gibbous_5_48x48,
  wi_moon_waning_gibbous_6_48x48,
  wi_moon_third_quarter_48x48,
  wi_moon_waning_crescent_1_48x48,
  wi_moon_waning_crescent_2_48x48,
  wi_moon_waning_crescent_3_48x48,
  wi_moon_waning_crescent_4_48x48,
  wi_moon_waning_crescent_5_48x48,
  wi_moon_waning_crescent_6_48x48,
  wi_moon_new_48x48 };
#endif
// end MOONPHASE_PRIMARY

#ifdef MOONPHASE_ALTERNATIVE
static const unsigned char *moon_phase_icon_arr[] = {
  wi_moon_alt_new_48x48,
  wi_moon_alt_waxing_crescent_1_48x48,
  wi_moon_alt_waxing_crescent_2_48x48,
  wi_moon_alt_waxing_crescent_3_48x48,
  wi_moon_alt_waxing_crescent_4_48x48,
  wi_moon_alt_waxing_crescent_5_48x48,
  wi_moon_alt_waxing_crescent_6_48x48,
  wi_moon_alt_first_quarter_48x48,
  wi_moon_alt_waxing_gibbous_1_48x48,
  wi_moon_alt_waxing_gibbous_2_48x48,
  wi_moon_alt_waxing_gibbous_3_48x48,
  wi_moon_alt_waxing_gibbous_4_48x48,
  wi_moon_alt_waxing_gibbous_5_48x48,
  wi_moon_alt_waxing_gibbous_6_48x48,
  wi_moon_alt_full_48x48,
  wi_moon_alt_waning_gibbous_1_48x48,
  wi_moon_alt_waning_gibbous_2_48x48,
  wi_moon_alt_waning_gibbous_3_48x48,
  wi_moon_alt_waning_gibbous_4_48x48,
  wi_moon_alt_waning_gibbous_5_48x48,
  wi_moon_alt_waning_gibbous_6_48x48,
  wi_moon_alt_third_quarter_48x48,
  wi_moon_alt_waning_crescent_1_48x48,
  wi_moon_alt_waning_crescent_2_48x48,
  wi_moon_alt_waning_crescent_3_48x48,
  wi_moon_alt_waning_crescent_4_48x48,
  wi_moon_alt_waning_crescent_5_48x48,
  wi_moon_alt_waning_crescent_6_48x48,
  wi_moon_alt_new_48x48 };
#endif
// end MOONPHASE_ALTERNATIVE

