pivoine31/esp32-weather-epd-pvmod/platformio/src/display_utils.cpp
/*  Returns the 48x48 moon phase icon bitmap based on api response between 0 and 1
 *  0 and 1 means new moon
 *  0.5 means full moon
 *  scale range to match 28 numbers of different icons
 *  offset +0.5 to shift icon to center of moon phase period
*/
const uint8_t *getMoonPhaseBitmap48(const owm_daily_t &daily)
{
  int n = static_cast<int>(daily.moon_phase * 28 + 0.5);
    return moon_phase_icon_arr[n];
} // end getMoonPhaseBitmap48


// Returns the current moon phase string
  const char *getMoonPhaseStr(const owm_daily_t &daily)
{
  int n = static_cast<int>(daily.moon_phase * 28 + 0.5);
  switch(n)
  {
  case 0 : return TXT_NEW_MOON;
  case 1 : return TXT_WAXING_CRESCENT;
  case 2 : return TXT_WAXING_CRESCENT;
  case 3 : return TXT_WAXING_CRESCENT;
  case 4 : return TXT_WAXING_CRESCENT;
  case 5 : return TXT_WAXING_CRESCENT;
  case 6 : return TXT_WAXING_CRESCENT;
  case 7 : return TXT_FIRST_QUARTER;
  case 8 : return TXT_WAXING_GIBBOUS;
  case 9 : return TXT_WAXING_GIBBOUS;
  case 10 : return TXT_WAXING_GIBBOUS;
  case 11 : return TXT_WAXING_GIBBOUS;
  case 12 : return TXT_WAXING_GIBBOUS;
  case 13 : return TXT_WAXING_GIBBOUS;
  case 14 : return TXT_FULL_MOON;
  case 15 : return TXT_WANING_GIBBOUS;
  case 16 : return TXT_WANING_GIBBOUS;
  case 17 : return TXT_WANING_GIBBOUS;
  case 18 : return TXT_WANING_GIBBOUS;
  case 19 : return TXT_WANING_GIBBOUS;
  case 20 : return TXT_WANING_GIBBOUS;
  case 21 : return TXT_THIRD_QUARTER;
  case 22 : return TXT_WANING_CRESCENT;
  case 23 : return TXT_WANING_CRESCENT;
  case 24 : return TXT_WANING_CRESCENT;
  case 25 : return TXT_WANING_CRESCENT;
  case 26 : return TXT_WANING_CRESCENT;
  case 27 : return TXT_WANING_CRESCENT;
  case 28 : return TXT_NEW_MOON;
  default:  return "";
  }
} // end getMoonPhaseStr
#else // OLD_CODE

const uint8_t *getForecastBitmap64(const owm_daily_t &daily)
{
  int id = daily.weather.id;
  // always using the day icon for weather forecast
  // bool day = current.weather.icon.endsWith("d");
  bool cloudy = daily.clouds > 60.25; // partly cloudy / partly sunny
  bool windy = (daily.wind_speed >= 32.2 /*m/s*/
             || daily.wind_gust  >= 40.2 /*m/s*/);

  switch (id)
  {
  // Group 2xx: Thunderstorm
  case 200: // Thunderstorm  thunderstorm with light rain     11d
  case 201: // Thunderstorm  thunderstorm with rain           11d
  case 202: // Thunderstorm  thunderstorm with heavy rain     11d
  case 210: // Thunderstorm  light thunderstorm               11d
  case 211: // Thunderstorm  thunderstorm                     11d
  case 212: // Thunderstorm  heavy thunderstorm               11d
  case 221: // Thunderstorm  ragged thunderstorm              11d
    if (!cloudy) {return wi_day_thunderstorm_64x64;}
    return wi_thunderstorm_64x64;
  case 230: // Thunderstorm  thunderstorm with light drizzle  11d
  case 231: // Thunderstorm  thunderstorm with drizzle        11d
  case 232: // Thunderstorm  thunderstorm with heavy drizzle  11d
    if (!cloudy) {return wi_day_storm_showers_64x64;}
    return wi_storm_showers_64x64;
  // Group 3xx: Drizzle
  case 300: // Drizzle       light intensity drizzle          09d
  case 301: // Drizzle       drizzle                          09d
  case 302: // Drizzle       heavy intensity drizzle          09d
  case 310: // Drizzle       light intensity drizzle rain     09d
  case 311: // Drizzle       drizzle rain                     09d
  case 312: // Drizzle       heavy intensity drizzle rain     09d
  case 313: // Drizzle       shower rain and drizzle          09d
  case 314: // Drizzle       heavy shower rain and drizzle    09d
  case 321: // Drizzle       shower drizzle                   09d
    if (!cloudy) {return wi_day_showers_64x64;}
    return wi_showers_64x64;
  // Group 5xx: Rain
  case 500: // Rain          light rain                       10d
  case 501: // Rain          moderate rain                    10d
  case 502: // Rain          heavy intensity rain             10d
  case 503: // Rain          very heavy rain                  10d
  case 504: // Rain          extreme rain                     10d
    if (!cloudy && windy) {return wi_day_rain_wind_64x64;}
    if (!cloudy)          {return wi_day_rain_64x64;}
    if (windy)            {return wi_rain_wind_64x64;}
    return wi_rain_64x64;
  case 511: // Rain          freezing rain                    13d
    if (!cloudy) {return wi_day_rain_mix_64x64;}
    return wi_rain_mix_64x64;
  case 520: // Rain          light intensity shower rain      09d
  case 521: // Rain          shower rain                      09d
  case 522: // Rain          heavy intensity shower rain      09d
  case 531: // Rain          ragged shower rain               09d
    if (!cloudy) {return wi_day_showers_64x64;}
    return wi_showers_64x64;
  // Group 6xx: Snow
  case 600: // Snow          light snow                       13d
  case 601: // Snow          Snow                             13d
  case 602: // Snow          Heavy snow                       13d
    if (!cloudy && windy) {return wi_day_snow_wind_64x64;}
    if (!cloudy)          {return wi_day_snow_64x64;}
    if (windy)            {return wi_snow_wind_64x64;}
    return wi_snow_64x64;
  case 611: // Snow          Sleet                            13d
  case 612: // Snow          Light shower sleet               13d
  case 613: // Snow          Shower sleet                     13d
    if (!cloudy) {return wi_day_sleet_64x64;}
    return wi_sleet_64x64;
  case 615: // Snow          Light rain and snow              13d
  case 616: // Snow          Rain and snow                    13d
  case 620: // Snow          Light shower snow                13d
  case 621: // Snow          Shower snow                      13d
  case 622: // Snow          Heavy shower snow                13d
    if (!cloudy) {return wi_day_rain_mix_64x64;}
    return wi_rain_mix_64x64;
  // Group 7xx: Atmosphere
  case 701: // Mist          mist                             50d
    if (!cloudy) {return wi_day_fog_64x64;}
    return wi_fog_64x64;
  case 711: // Smoke         Smoke                            50d
    return wi_smoke_64x64;
  case 721: // Haze          Haze                             50d
    return wi_day_haze_64x64;
    if (!cloudy) {return wi_day_haze_196x196;}
    return wi_dust_196x196;
  case 731: // Dust          sand/dust whirls                 50d
    return wi_sandstorm_64x64;
  case 741: // Fog           fog                              50d
    if (!cloudy) {return wi_day_fog_64x64;}
    return wi_fog_64x64;
  case 751: // Sand          sand                             50d
    return wi_sandstorm_64x64;
  case 761: // Dust          dust                             50d
    return wi_dust_64x64;
  case 762: // Ash           volcanic ash                     50d
    return wi_volcano_64x64;
  case 771: // Squall        squalls                          50d
    return wi_cloudy_gusts_64x64;
  case 781: // Tornado       tornado                          50d
    return wi_tornado_64x64;
  // Group 800: Clear
  case 800: // Clear         clear sky                        01d 01n
    if (windy) {return wi_strong_wind_64x64;}
    return wi_day_sunny_64x64;
  // Group 80x: Clouds
  case 801: // Clouds        few clouds: 11-25%               02d 02n
    if (windy) {return wi_day_cloudy_gusts_64x64;}
    return wi_day_sunny_overcast_64x64;
  case 802: // Clouds        scattered clouds: 25-50%         03d 03n
  case 803: // Clouds        broken clouds: 51-84%            04d 04n
    if (windy) {return wi_day_cloudy_gusts_64x64;}
    return wi_day_cloudy_64x64;
  case 804: // Clouds        overcast clouds: 85-100%         04d 04n
    if (windy) {return wi_cloudy_gusts_64x64;}
    return wi_cloudy_64x64;
  default:
    // OpenWeatherMap maybe this is a new icon in one of the existing groups
    if (id >= 200 && id < 300) {return wi_thunderstorm_64x64;}
    if (id >= 300 && id < 400) {return wi_showers_64x64;}
    if (id >= 500 && id < 600) {return wi_rain_64x64;}
    if (id >= 600 && id < 700) {return wi_snow_64x64;}
    if (id >= 700 && id < 800) {return wi_fog_64x64;}
    if (id >= 800 && id < 900) {return wi_cloudy_64x64;}
    return wi_na_64x64;
  }
} // end getForecastBitmap64

