pivoine31/esp32-weather-epd-pvmod/platformio/src/display_utils.cpp
/*
 * (DISPLAY_HOURLY_ICONS)
 * Takes the hourly weather forecast (from OpenWeatherMap API
 * response) and returns a pointer to the icon's 32x32 bitmap.
 *
 * Uses multiple factors to return more detailed icons than the simple icon
 * catagories that OpenWeatherMap provides.
 *
 * Last Updated: June 26, 2022
 *
 * References:
 *   https://openweathermap.org/weather-conditions
 *   https://www.weather.gov/ajk/ForecastTerms
 */
const uint8_t *getForecastBitmap32(const owm_hourly_t &hourly)
{
  int id = hourly.weather.id;
  // OpenWeatherMap indicates sun is up with d otherwise n for night
  bool day    = hourly.weather.icon.endsWith("d");
  bool cloudy = hourly.clouds > 60.25; // partly cloudy / partly sunny
  bool windy  = (hourly.wind_speed >= 32.2 /*m/s*/
              || hourly.wind_gust  >= 40.2 /*m/s*/);

  Serial.printf("[weather] id=%d, desc=%s, icon=%s, clouds=%d, wind=%f-%f\n",
		hourly.weather.id,
		hourly.weather.description.c_str(),
		hourly.weather.icon.c_str(),
                hourly.clouds,
                hourly.wind_speed, hourly.wind_gust);

  switch (id)
  {
  // Group 2xx: Thunderstorm
  case 200: // Thunderstorm  thunderstorm with light rain     11d
  case 201: // Thunderstorm  thunderstorm with rain           11d
  case 202: // Thunderstorm  thunderstorm with heavy rain     11d
  case 210: // Thunderstorm  light thunderstorm               11d
  case 211: // Thunderstorm  thunderstorm                     11d
  case 212: // Thunderstorm  heavy thunderstorm               11d
  case 221: // Thunderstorm  ragged thunderstorm              11d
    if (!cloudy && day)           {return wi_day_thunderstorm_32x32;}
    if (!cloudy && !day)          {return wi_night_alt_thunderstorm_32x32;}
    return wi_thunderstorm_32x32;
  case 230: // Thunderstorm  thunderstorm with light drizzle  11d
  case 231: // Thunderstorm  thunderstorm with drizzle        11d
  case 232: // Thunderstorm  thunderstorm with heavy drizzle  11d
    if (!cloudy && day)           {return wi_day_storm_showers_32x32;}
    if (!cloudy && !day)          {return wi_night_alt_storm_showers_32x32;}
    return wi_storm_showers_32x32;
  // Group 3xx: Drizzle
  case 300: // Drizzle       light intensity drizzle          09d
  case 301: // Drizzle       drizzle                          09d
  case 302: // Drizzle       heavy intensity drizzle          09d
  case 310: // Drizzle       light intensity drizzle rain     09d
  case 311: // Drizzle       drizzle rain                     09d
  case 312: // Drizzle       heavy intensity drizzle rain     09d
  case 313: // Drizzle       shower rain and drizzle          09d
  case 314: // Drizzle       heavy shower rain and drizzle    09d
  case 321: // Drizzle       shower drizzle                   09d
    if (!cloudy && day)           {return wi_day_showers_32x32;}
    if (!cloudy && !day)          {return wi_night_alt_showers_32x32;}
    return wi_showers_32x32;
  // Group 5xx: Rain
  case 500: // Rain          light rain                       10d
  case 501: // Rain          moderate rain                    10d
  case 502: // Rain          heavy intensity rain             10d
  case 503: // Rain          very heavy rain                  10d
  case 504: // Rain          extreme rain                     10d
    if (!cloudy && day && windy)  {return wi_day_rain_wind_32x32;}
    if (!cloudy && day)           {return wi_day_rain_32x32;}
    if (!cloudy && !day && windy) {return wi_night_alt_rain_wind_32x32;}
    if (!cloudy && !day)          {return wi_night_alt_rain_32x32;}
    if (windy)                    {return wi_rain_wind_32x32;}
    return wi_rain_32x32;
  case 511: // Rain          freezing rain                    13d
    if (!cloudy && day)           {return wi_day_rain_mix_32x32;}
    if (!cloudy && !day)          {return wi_night_alt_rain_mix_32x32;}
    return wi_rain_mix_32x32;
  case 520: // Rain          light intensity shower rain      09d
  case 521: // Rain          shower rain                      09d
  case 522: // Rain          heavy intensity shower rain      09d
  case 531: // Rain          ragged shower rain               09d
    if (!cloudy && day)           {return wi_day_showers_32x32;}
    if (!cloudy && !day)          {return wi_night_alt_showers_32x32;}
    return wi_showers_32x32;
  // Group 6xx: Snow
  case 600: // Snow          light snow                       13d
  case 601: // Snow          Snow                             13d
  case 602: // Snow          Heavy snow                       13d
    if (!cloudy && day && windy)  {return wi_day_snow_wind_32x32;}
    if (!cloudy && day)           {return wi_day_snow_32x32;}
    if (!cloudy && !day && windy) {return wi_night_alt_snow_wind_32x32;}
    if (!cloudy && !day)          {return wi_night_alt_snow_32x32;}
    if (windy)                    {return wi_snow_wind_32x32;}
    return wi_snow_32x32;
  case 611: // Snow          Sleet                            13d
  case 612: // Snow          Light shower sleet               13d
  case 613: // Snow          Shower sleet                     13d
    if (!cloudy && day)           {return wi_day_sleet_32x32;}
    if (!cloudy && !day)          {return wi_night_alt_sleet_32x32;}
    return wi_sleet_32x32;
  case 615: // Snow          Light rain and snow              13d
  case 616: // Snow          Rain and snow                    13d
  case 620: // Snow          Light shower snow                13d
  case 621: // Snow          Shower snow                      13d
  case 622: // Snow          Heavy shower snow                13d
    if (!cloudy && day)          {return wi_day_rain_mix_32x32;}
    if (!cloudy && !day)         {return wi_night_alt_rain_mix_32x32;}
    return wi_rain_mix_32x32;
  // Group 7xx: Atmosphere
  case 701: // Mist          mist                             50d
    if (!cloudy && day)          {return wi_day_fog_32x32;}
    if (!cloudy && !day)         {return wi_night_fog_32x32;}
    return wi_fog_32x32;
  case 711: // Smoke         Smoke                            50d
    return wi_smoke_32x32;
  case 721: // Haze          Haze                             50d
    if (day && !cloudy)          {return wi_day_haze_32x32;}
    return wi_dust_32x32;
  case 731: // Dust          sand/dust whirls                 50d
    return wi_sandstorm_32x32;
  case 741: // Fog           fog                              50d
    if (!cloudy && day)          {return wi_day_fog_32x32;}
    if (!cloudy && !day)         {return wi_night_fog_32x32;}
    return wi_fog_32x32;
  case 751: // Sand          sand                             50d
    return wi_sandstorm_32x32;
  case 761: // Dust          dust                             50d
    return wi_dust_32x32;
  case 762: // Ash           volcanic ash                     50d
    return wi_volcano_32x32;
  case 771: // Squall        squalls                          50d
    return wi_cloudy_gusts_32x32;
  case 781: // Tornado       tornado                          50d
    return wi_tornado_32x32;
  // Group 800: Clear
  case 800: // Clear         clear sky                        01d
    if (windy)                   {return wi_strong_wind_32x32;}
    if (!day)                    {return wi_night_clear_32x32;}
    return wi_day_sunny_32x32;
  // Group 80x: Clouds
  case 801: // Clouds        few clouds: 11-25%               02d
    if (windy)                   {return wi_day_cloudy_gusts_32x32;}
    if (!day)                    {return wi_night_alt_partly_cloudy_32x32;}
    return wi_day_sunny_overcast_32x32;
  case 802: // Clouds        scattered clouds: 25-50%         03d
  case 803: // Clouds        broken clouds: 51-84%            04d
    if (windy)                  {return wi_day_cloudy_gusts_32x32;}
    if (!day)                   {return wi_night_alt_cloudy_gusts_32x32;}
    return wi_day_cloudy_32x32;
  case 804: // Clouds        overcast clouds: 85-100%         04d
    if (windy)                  {return wi_cloudy_gusts_32x32;}
    return wi_cloudy_32x32;
  default:
    // OpenWeatherMap maybe this is a new icon in one of the existing groups
    if (id >= 200 && id < 300)  {return wi_thunderstorm_32x32;}
    if (id >= 300 && id < 400)  {return wi_showers_32x32;}
    if (id >= 500 && id < 600)  {return wi_rain_32x32;}
    if (id >= 600 && id < 700)  {return wi_snow_32x32;}
    if (id >= 700 && id < 800)  {return wi_fog_32x32;}
    if (id >= 800 && id < 900)  {return wi_cloudy_32x32;}
    return wi_na_32x32;
  }
} // end getForecastBitmap32

