pivoine31/esp32-weather-epd-pvmod/platformio/src/display_utils.cpp
/* Takes the current weather and today's daily weather forcast (from
 * OpenWeatherMap API response) and returns a pointer to the icon's 196x196
 * bitmap.
 *
 * The daily weather forcast of today is needed for moonrise and moonset times.
 */
const uint8_t *getCurrentConditionsBitmap196(const owm_current_t &current,
                                             const owm_daily_t   &today)
{
  int id = current.weather.id;
  // OpenWeatherMap indicates sun is up with d otherwise n for night
  bool day = current.weather.icon.endsWith("d");
  // moon is out if current time is after moonrise but before moonset
  // OR if moonrises after moonset and the current time is after moonrise
  bool moon = (current.dt >= today.moonrise && current.dt < today.moonset)
           || (today.moonrise > today.moonset && current.dt >= today.moonrise);
  bool cloudy = current.clouds > 60.25; // partly cloudy / partly sunny
  bool windy = (current.wind_speed >= 32.2 /*m/s*/
             || current.wind_gust  >= 40.2 /*m/s*/);

  switch (id)
  {
  // Group 2xx: Thunderstorm
  case 200: // Thunderstorm  thunderstorm with light rain     11d
  case 201: // Thunderstorm  thunderstorm with rain           11d
  case 202: // Thunderstorm  thunderstorm with heavy rain     11d
  case 210: // Thunderstorm  light thunderstorm               11d
  case 211: // Thunderstorm  thunderstorm                     11d
  case 212: // Thunderstorm  heavy thunderstorm               11d
  case 221: // Thunderstorm  ragged thunderstorm              11d
    if (!cloudy && day)          {return wi_day_thunderstorm_196x196;}
    if (!cloudy && !day && moon) {return wi_night_alt_thunderstorm_196x196;}
    return wi_thunderstorm_196x196;
  case 230: // Thunderstorm  thunderstorm with light drizzle  11d
  case 231: // Thunderstorm  thunderstorm with drizzle        11d
  case 232: // Thunderstorm  thunderstorm with heavy drizzle  11d
    if (!cloudy && day)          {return wi_day_storm_showers_196x196;}
    if (!cloudy && !day && moon) {return wi_night_alt_storm_showers_196x196;}
    return wi_storm_showers_196x196;
  // Group 3xx: Drizzle
  case 300: // Drizzle       light intensity drizzle          09d
  case 301: // Drizzle       drizzle                          09d
  case 302: // Drizzle       heavy intensity drizzle          09d
  case 310: // Drizzle       light intensity drizzle rain     09d
  case 311: // Drizzle       drizzle rain                     09d
  case 312: // Drizzle       heavy intensity drizzle rain     09d
  case 313: // Drizzle       shower rain and drizzle          09d
  case 314: // Drizzle       heavy shower rain and drizzle    09d
  case 321: // Drizzle       shower drizzle                   09d
    if (!cloudy && day)          {return wi_day_showers_196x196;}
    if (!cloudy && !day && moon) {return wi_night_alt_showers_196x196;}
    return wi_showers_196x196;
  // Group 5xx: Rain
  case 500: // Rain          light rain                       10d
  case 501: // Rain          moderate rain                    10d
  case 502: // Rain          heavy intensity rain             10d
  case 503: // Rain          very heavy rain                  10d
  case 504: // Rain          extreme rain                     10d
    if (!cloudy && day && windy)          {return wi_day_rain_wind_196x196;}
    if (!cloudy && day)                   {return wi_day_rain_196x196;}
    if (!cloudy && !day && moon && windy) {return wi_night_alt_rain_wind_196x196;}
    if (!cloudy && !day && moon)          {return wi_night_alt_rain_196x196;}
    if (windy)                            {return wi_rain_wind_196x196;}
    return wi_rain_196x196;
  case 511: // Rain          freezing rain                    13d
    if (!cloudy && day)          {return wi_day_rain_mix_196x196;}
    if (!cloudy && !day && moon) {return wi_night_alt_rain_mix_196x196;}
    return wi_rain_mix_196x196;
  case 520: // Rain          light intensity shower rain      09d
  case 521: // Rain          shower rain                      09d
  case 522: // Rain          heavy intensity shower rain      09d
  case 531: // Rain          ragged shower rain               09d
    if (!cloudy && day)          {return wi_day_showers_196x196;}
    if (!cloudy && !day && moon) {return wi_night_alt_showers_196x196;}
    return wi_showers_196x196;
  // Group 6xx: Snow
  case 600: // Snow          light snow                       13d
  case 601: // Snow          Snow                             13d
  case 602: // Snow          Heavy snow                       13d
    if (!cloudy && day && windy)          {return wi_day_snow_wind_196x196;}
    if (!cloudy && day)                   {return wi_day_snow_196x196;}
    if (!cloudy && !day && moon && windy) {return wi_night_alt_snow_wind_196x196;}
    if (!cloudy && !day && moon)          {return wi_night_alt_snow_196x196;}
    if (windy)                            {return wi_snow_wind_196x196;}
    return wi_snow_196x196;
  case 611: // Snow          Sleet                            13d
  case 612: // Snow          Light shower sleet               13d
  case 613: // Snow          Shower sleet                     13d
    if (!cloudy && day)          {return wi_day_sleet_196x196;}
    if (!cloudy && !day && moon) {return wi_night_alt_sleet_196x196;}
    return wi_sleet_196x196;
  case 615: // Snow          Light rain and snow              13d
  case 616: // Snow          Rain and snow                    13d
  case 620: // Snow          Light shower snow                13d
  case 621: // Snow          Shower snow                      13d
  case 622: // Snow          Heavy shower snow                13d
    if (!cloudy && day)          {return wi_day_rain_mix_196x196;}
    if (!cloudy && !day && moon) {return wi_night_alt_rain_mix_196x196;}
    return wi_rain_mix_196x196;
  // Group 7xx: Atmosphere
  case 701: // Mist          mist                             50d
    if (!cloudy && day)          {return wi_day_fog_196x196;}
    if (!cloudy && !day && moon) {return wi_night_fog_196x196;}
    return wi_fog_196x196;
  case 711: // Smoke         Smoke                            50d
    return wi_smoke_196x196;
  case 721: // Haze          Haze                             50d
    if (day && !cloudy) {return wi_day_haze_196x196;}
    return wi_dust_196x196;
  case 731: // Dust          sand/dust whirls                 50d
    return wi_sandstorm_196x196;
  case 741: // Fog           fog                              50d
    if (!cloudy && day)          {return wi_day_fog_196x196;}
    if (!cloudy && !day && moon) {return wi_night_fog_196x196;}
    return wi_fog_196x196;
  case 751: // Sand          sand                             50d
    return wi_sandstorm_196x196;
  case 761: // Dust          dust                             50d
    return wi_dust_196x196;
  case 762: // Ash           volcanic ash                     50d
    return wi_volcano_196x196;
  case 771: // Squall        squalls                          50d
    return wi_cloudy_gusts_196x196;
  case 781: // Tornado       tornado                          50d
    return wi_tornado_196x196;
  // Group 800: Clear
  case 800: // Clear         clear sky                        01d 01n
    if (windy)         {return wi_strong_wind_196x196;}
    if (!day && moon)  {return wi_night_clear_196x196;}
    if (!day && !moon) {return wi_stars_196x196;}
    return wi_day_sunny_196x196;
  // Group 80x: Clouds
  case 801: // Clouds        few clouds: 11-25%               02d 02n
    if (windy)         {return wi_strong_wind_196x196;}
    if (!day && moon)  {return wi_night_alt_partly_cloudy_196x196;}
    if (!day && !moon) {return wi_stars_196x196;}
    return wi_day_sunny_overcast_196x196;
  case 802: // Clouds        scattered clouds: 25-50%         03d 03n
  case 803: // Clouds        broken clouds: 51-84%            04d 04n
    if (windy && day)           {return wi_day_cloudy_gusts_196x196;}
    if (windy && !day && moon)  {return wi_night_alt_cloudy_gusts_196x196;}
    if (windy && !day && !moon) {return wi_cloudy_gusts_196x196;}
    if (!day && moon)           {return wi_night_alt_cloudy_196x196;}
    if (!day && !moon)          {return wi_cloud_196x196;}
    return wi_day_cloudy_196x196;
  case 804: // Clouds        overcast clouds: 85-100%         04d 04n
    if (windy) {return wi_cloudy_gusts_196x196;}
    return wi_cloudy_196x196;
  default:
    // maybe this is a new icon in one of the existing groups
    if (id >= 200 && id < 300) {return wi_thunderstorm_196x196;}
    if (id >= 300 && id < 400) {return wi_showers_196x196;}
    if (id >= 500 && id < 600) {return wi_rain_196x196;}
    if (id >= 600 && id < 700) {return wi_snow_196x196;}
    if (id >= 700 && id < 800) {return wi_fog_196x196;}
    if (id >= 800 && id < 900) {return wi_cloudy_196x196;}
    return wi_na_196x196;
  }
} // end getCurrentConditionsBitmap196

/* Returns a 32x32 bitmap for a given alert.
 *
 * The purpose of this function is to return a relevant bitmap for an alert.
 * This is done by searching the event text for key terminology defined in the
 * included locale header.
 * If a relevant category can not be determined, the default alert bitmap will
 * be returned. (warning triangle icon)
 */
const uint8_t *getAlertBitmap32(const owm_alerts_t &alert)
{
  enum alert_category c = getAlertCategory(alert);
  switch (c)
  {
  // this is the default if an alert wasn't associated with a catagory
  case NOT_FOUND:            return warning_icon_32x32;

  case SMOG:                 return wi_smog_32x32;
  case SMOKE:                return wi_smoke_32x32;
  case FOG:                  return wi_fog_32x32;
  case METEOR:               return wi_meteor_32x32;
  case NUCLEAR:              return ionizing_radiation_symbol_32x32;
  case BIOHAZARD:            return biological_hazard_symbol_32x32;
  case EARTHQUAKE:           return wi_earthquake_32x32;
  case TSUNAMI:              return wi_tsunami_32x32;
  case FIRE:                 return wi_fire_32x32;
  case HEAT:                 return wi_thermometer_32x32;
  case WINTER:               return wi_snowflake_cold_32x32;
  case LIGHTNING:            return wi_lightning_32x32;
  case SANDSTORM:            return wi_sandstorm_32x32;
  case FLOOD:                return wi_flood_32x32;
  case VOLCANO:              return wi_volcano_32x32;
  case AIR_QUALITY:          return wi_dust_32x32;
  case TORNADO:              return wi_tornado_32x32;
  case SMALL_CRAFT_ADVISORY: return wi_small_craft_advisory_32x32;
  case GALE_WARNING:         return wi_gale_warning_32x32;
  case STORM_WARNING:        return wi_storm_warning_32x32;
  case HURRICANE_WARNING:    return wi_hurricane_warning_32x32;
  case HURRICANE:            return wi_hurricane_32x32;
  case DUST:                 return wi_dust_32x32;
  case STRONG_WIND:          return wi_strong_wind_32x32;

  // this code will never be reached
  default:                   return wi_na_48x48;
  }
} // end getAlertBitmap32

/* Returns a 48x48 bitmap for a given alert.
 *
 * The purpose of this function is to return a relevant bitmap for an alert.
 * This is done by searching the event text for key terminology defined in the
 * included locale header.
 * If a relevant category can not be determined, the default alert bitmap will
 * be returned. (warning triangle icon)
 */
const uint8_t *getAlertBitmap48(const owm_alerts_t &alert)
{
  enum alert_category c = getAlertCategory(alert);
  switch (c)
  {
  // this is the default if an alert wasn't associated with a catagory
  case NOT_FOUND:            return warning_icon_48x48;

