pivoine31/esp32-weather-epd-pvmod/platformio/src/display_utils.cpp
  wind_direction_meteorological_338deg_24x24,
  wind_direction_meteorological_339deg_24x24,
  wind_direction_meteorological_340deg_24x24,
  wind_direction_meteorological_341deg_24x24,
  wind_direction_meteorological_342deg_24x24,
  wind_direction_meteorological_343deg_24x24,
  wind_direction_meteorological_344deg_24x24,
  wind_direction_meteorological_345deg_24x24,
  wind_direction_meteorological_346deg_24x24,
  wind_direction_meteorological_347deg_24x24,
  wind_direction_meteorological_348deg_24x24,
  wind_direction_meteorological_349deg_24x24,
  wind_direction_meteorological_350deg_24x24,
  wind_direction_meteorological_351deg_24x24,
  wind_direction_meteorological_352deg_24x24,
  wind_direction_meteorological_353deg_24x24,
  wind_direction_meteorological_354deg_24x24,
  wind_direction_meteorological_355deg_24x24,
  wind_direction_meteorological_356deg_24x24,
  wind_direction_meteorological_357deg_24x24,
  wind_direction_meteorological_358deg_24x24,
  wind_direction_meteorological_359deg_24x24};
#endif // end WIND_ICONS_360

/* Returns a 24x24 wind direction icon bitmap for angles 0 to 359 degrees
 * Parameter is meteorological wind direction, arrow points in the direction the
 * wind is going.
 */
const uint8_t *getWindBitmap24(int windDeg)
{
  windDeg %= 360; // enforce domain
  // number of directions
  int n = sizeof(wind_direction_icon_arr)
          / sizeof(wind_direction_icon_arr[0]);
  int arr_offset = (int) ( (windDeg + (360 / n / 2)) % 360 )
                         / ( 360 / (float) n );

  return wind_direction_icon_arr[arr_offset];
} // end getWindBitmap24

/* Returns a pointer to a string that expresses the Compass Point Notation (CPN)
 * of the given windDeg.
 *
 *   PRECISION                  #     ERROR   EXAMPLE
 *   Cardinal                   4  ±45.000°   E
 *   Intercardinal (Ordinal)    8  ±22.500°   NE
 *   Secondary Intercardinal   16  ±11.250°   NNE
 *   Tertiary Intercardinal    32   ±5.625°   NbE
 */
const char *getCompassPointNotation(int windDeg)
{
#if defined(WIND_INDICATOR_CPN_CARDINAL)
  const int precision = 4;
#elif defined(WIND_INDICATOR_CPN_INTERCARDINAL)
  const int precision = 8;
#elif defined(WIND_INDICATOR_CPN_SECONDARY_INTERCARDINAL)
  const int precision = 16;
#elif defined(WIND_INDICATOR_CPN_TERTIARY_INTERCARDINAL)
  const int precision = 32;
#else
  const int precision = 4;
#endif

  windDeg %= 360; // enforce domain
  int arr_offset = (int) (windDeg / ( 360 / (float) precision ))
                         * ( 32 / precision) ;

  return COMPASS_POINT_NOTATION[arr_offset];
} // end getCompassPointNotation

/* This function returns a pointer to a string representing the meaning for a
 * HTTP response status code or an arduino client error code.
 * ArduinoJson DeserializationError codes are also included here and are given a
 * negative 100 offset to distinguish them from other client error codes.
 *
 * HTTP response status codes [100, 599]
 * https://developer.mozilla.org/en-US/docs/Web/HTTP/Status
 *
 * HTTP client errors [0, -255]
 * https://github.com/espressif/arduino-esp32/blob/master/libraries/HTTPClient/src/HTTPClient.h
 *
 * ArduinoJson DeserializationError codes [-256, -511]
 * https://arduinojson.org/v6/api/misc/deserializationerror/
 *
 * WiFi Status codes [-512, -767]
 * https://github.com/espressif/arduino-esp32/blob/master/libraries/WiFi/src/WiFiType.h
 */
const char *getHttpResponsePhrase(int code)
{
  switch (code)
  {
  // 1xx - Informational Responses
  case 100: return TXT_HTTP_RESPONSE_100;
  case 101: return TXT_HTTP_RESPONSE_101;
  case 102: return TXT_HTTP_RESPONSE_102;
  case 103: return TXT_HTTP_RESPONSE_103;

  // 2xx - Successful Responses
  case 200: return TXT_HTTP_RESPONSE_200;
  case 201: return TXT_HTTP_RESPONSE_201;
  case 202: return TXT_HTTP_RESPONSE_202;
  case 203: return TXT_HTTP_RESPONSE_203;
  case 204: return TXT_HTTP_RESPONSE_204;
  case 205: return TXT_HTTP_RESPONSE_205;
  case 206: return TXT_HTTP_RESPONSE_206;
  case 207: return TXT_HTTP_RESPONSE_207;
  case 208: return TXT_HTTP_RESPONSE_208;
  case 226: return TXT_HTTP_RESPONSE_226;

  // 3xx - Redirection Responses
  case 300: return TXT_HTTP_RESPONSE_300;
  case 301: return TXT_HTTP_RESPONSE_301;
  case 302: return TXT_HTTP_RESPONSE_302;
  case 303: return TXT_HTTP_RESPONSE_303;
  case 304: return TXT_HTTP_RESPONSE_304;
  case 305: return TXT_HTTP_RESPONSE_305;
  case 307: return TXT_HTTP_RESPONSE_307;
  case 308: return TXT_HTTP_RESPONSE_308;

  // 4xx - Client Error Responses
  case 400: return TXT_HTTP_RESPONSE_400;
  case 401: return TXT_HTTP_RESPONSE_401;
  case 402: return TXT_HTTP_RESPONSE_402;
  case 403: return TXT_HTTP_RESPONSE_403;
  case 404: return TXT_HTTP_RESPONSE_404;
  case 405: return TXT_HTTP_RESPONSE_405;
  case 406: return TXT_HTTP_RESPONSE_406;
  case 407: return TXT_HTTP_RESPONSE_407;
  case 408: return TXT_HTTP_RESPONSE_408;
  case 409: return TXT_HTTP_RESPONSE_409;
  case 410: return TXT_HTTP_RESPONSE_410;
  case 411: return TXT_HTTP_RESPONSE_411;
  case 412: return TXT_HTTP_RESPONSE_412;
  case 413: return TXT_HTTP_RESPONSE_413;
  case 414: return TXT_HTTP_RESPONSE_414;
  case 415: return TXT_HTTP_RESPONSE_415;
  case 416: return TXT_HTTP_RESPONSE_416;
  case 417: return TXT_HTTP_RESPONSE_417;
  case 418: return TXT_HTTP_RESPONSE_418;
  case 421: return TXT_HTTP_RESPONSE_421;
  case 422: return TXT_HTTP_RESPONSE_422;
  case 423: return TXT_HTTP_RESPONSE_423;
  case 424: return TXT_HTTP_RESPONSE_424;
  case 425: return TXT_HTTP_RESPONSE_425;
  case 426: return TXT_HTTP_RESPONSE_426;
  case 428: return TXT_HTTP_RESPONSE_428;
  case 429: return TXT_HTTP_RESPONSE_429;
  case 431: return TXT_HTTP_RESPONSE_431;
  case 451: return TXT_HTTP_RESPONSE_451;

  // 5xx - Server Error Responses
  case 500: return TXT_HTTP_RESPONSE_500;
  case 501: return TXT_HTTP_RESPONSE_501;
  case 502: return TXT_HTTP_RESPONSE_502;
  case 503: return TXT_HTTP_RESPONSE_503;
  case 504: return TXT_HTTP_RESPONSE_504;
  case 505: return TXT_HTTP_RESPONSE_505;
  case 506: return TXT_HTTP_RESPONSE_506;
  case 507: return TXT_HTTP_RESPONSE_507;
  case 508: return TXT_HTTP_RESPONSE_508;
  case 510: return TXT_HTTP_RESPONSE_510;
  case 511: return TXT_HTTP_RESPONSE_511;

