pivoine31/esp32-weather-epd-pvmod/platformio/src/display_utils.cpp
  // HTTP client errors [0, -255]
  case HTTPC_ERROR_CONNECTION_REFUSED:  return TXT_HTTPC_ERROR_CONNECTION_REFUSED;
  case HTTPC_ERROR_SEND_HEADER_FAILED:  return TXT_HTTPC_ERROR_SEND_HEADER_FAILED;
  case HTTPC_ERROR_SEND_PAYLOAD_FAILED: return TXT_HTTPC_ERROR_SEND_PAYLOAD_FAILED;
  case HTTPC_ERROR_NOT_CONNECTED:       return TXT_HTTPC_ERROR_NOT_CONNECTED;
  case HTTPC_ERROR_CONNECTION_LOST:     return TXT_HTTPC_ERROR_CONNECTION_LOST;
  case HTTPC_ERROR_NO_STREAM:           return TXT_HTTPC_ERROR_NO_STREAM;
  case HTTPC_ERROR_NO_HTTP_SERVER:      return TXT_HTTPC_ERROR_NO_HTTP_SERVER;
  case HTTPC_ERROR_TOO_LESS_RAM:        return TXT_HTTPC_ERROR_TOO_LESS_RAM;
  case HTTPC_ERROR_ENCODING:            return TXT_HTTPC_ERROR_ENCODING;
  case HTTPC_ERROR_STREAM_WRITE:        return TXT_HTTPC_ERROR_STREAM_WRITE;
  case HTTPC_ERROR_READ_TIMEOUT:        return TXT_HTTPC_ERROR_READ_TIMEOUT;

  // ArduinoJson DeserializationError codes  [-256, -511]
  case -256 - (DeserializationError::Code::Ok):              return TXT_DESERIALIZATION_ERROR_OK;
  case -256 - (DeserializationError::Code::EmptyInput):      return TXT_DESERIALIZATION_ERROR_EMPTY_INPUT;
  case -256 - (DeserializationError::Code::IncompleteInput): return TXT_DESERIALIZATION_ERROR_INCOMPLETE_INPUT;
  case -256 - (DeserializationError::Code::InvalidInput):    return TXT_DESERIALIZATION_ERROR_INVALID_INPUT;
  case -256 - (DeserializationError::Code::NoMemory):        return TXT_DESERIALIZATION_ERROR_NO_MEMORY;
  case -256 - (DeserializationError::Code::TooDeep):         return TXT_DESERIALIZATION_ERROR_TOO_DEEP;

  // WiFi Status codes [-512, -767]
  case -512 - WL_NO_SHIELD:       return TXT_WL_NO_SHIELD;
  // case -512 - WL_STOPPED:       return TXT_WL_STOPPED; // future
  case -512 - WL_IDLE_STATUS:     return TXT_WL_IDLE_STATUS;
  case -512 - WL_NO_SSID_AVAIL:   return TXT_WL_NO_SSID_AVAIL;
  case -512 - WL_SCAN_COMPLETED:  return TXT_WL_SCAN_COMPLETED;
  case -512 - WL_CONNECTED:       return TXT_WL_CONNECTED;
  case -512 - WL_CONNECT_FAILED:  return TXT_WL_CONNECT_FAILED;
  case -512 - WL_CONNECTION_LOST: return TXT_WL_CONNECTION_LOST;
  case -512 - WL_DISCONNECTED:    return TXT_WL_DISCONNECTED;

  default:  return "";
  }
} // end getHttpResponsePhrase


/* This function returns a pointer to a string representing the meaning for a
 * WiFi status (wl_status_t).
 *
 * wl_status_t type definition
 * https://github.com/espressif/arduino-esp32/blob/master/libraries/WiFi/src/WiFiType.h
 */
const char *getWifiStatusPhrase(wl_status_t status)
{
  switch (status)
  {
  case WL_NO_SHIELD:       return TXT_WL_NO_SHIELD;
  // case WL_STOPPED:       return TXT_WL_STOPPED; // future
  case WL_IDLE_STATUS:     return TXT_WL_IDLE_STATUS;
  case WL_NO_SSID_AVAIL:   return TXT_WL_NO_SSID_AVAIL;
  case WL_SCAN_COMPLETED:  return TXT_WL_SCAN_COMPLETED;
  case WL_CONNECTED:       return TXT_WL_CONNECTED;
  case WL_CONNECT_FAILED:  return TXT_WL_CONNECT_FAILED;
  case WL_CONNECTION_LOST: return TXT_WL_CONNECTION_LOST;
  case WL_DISCONNECTED:    return TXT_WL_DISCONNECTED;

  default:  return "";
  }
} // end getWifiStatusPhrase

/* This function sets the builtin LED to LOW and disables it even during deep
 * sleep.
 */
void disableBuiltinLED()
{
  pinMode(LED_BUILTIN, OUTPUT);
  digitalWrite(LED_BUILTIN, LOW);
  gpio_hold_en(static_cast<gpio_num_t>(LED_BUILTIN));
  gpio_deep_sleep_hold_en();
  return;
} // end disableBuiltinLED

#endif // OLD_CODE
